ci_project1_deploy/app/Controllers/frontend/ProductController.php

    public function show($id = null)
    {
        $model = new ProductModel();
        $data = $model->getWhere(['product_id' => $id])->getResult();
---
SELECT *
FROM `products`
WHERE `product_id` = '2'