ci_project1_deploy/app/Controllers/ProductController.php

SELECT *
FROM `products`
---
    public function index()
    {
        $data['items'] = $this->products->findAll();

INSERT INTO `products` (`product`, `category`, `model`, `price`, `sku`, `photo`) VALUES ('aaaaaa', 'Belt', 'sss', '7856', 'ikol', 'uploadnow.io_download_R5q4mDZ.png')
---
    public function store(){
        // return $this->request->getVar('product');
        $data = [
            'product' => $this->request->getVar('product'),
            'category' => $this->request->getVar('category'),
            'model' => $this->request->getVar('model'),
            'price' => $this->request->getVar('price'),
            'sku' => $this->request->getVar('sku'),
            'photo' => $this->request->getFile('photo')->getName(),
        ];

        //print_r($data);


        $rules = [
            'product' => 'required|max_length[30]|min_length[3]',
            'price' => 'required|numeric',
            'sku' => 'required|min_length[3]',
            'photo' => 'uploaded[photo]|max_size[photo,102400]|ext_in[photo,jpg,jpeg,png,webp]'
        ];

        if(! $this->validate($rules)){
            return view('products/create');
        }else{
            $img = $this->request->getFile('photo');
            $img->move(WRITEPATH . 'uploads');
            $this->products->insert($data);