ci_project1/app/Controllers/ProductController.php

    public function index()
    {
        $data['items'] = $this->products->findAll();
---
SELECT *
FROM `products`

    public function edit($id){
        //echo $id;
        $data = $this->products->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`product_id` = '10'

    public function update($id){
        // $this->products = new ProductModel();
        $data = [
            'product' => $this->request->getPost('product'),
            'category' => $this->request->getPost('category'),
            'model' => $this->request->getPost('model'),
            'price' => $this->request->getPost('price'),
            'sku' => $this->request->getPost('sku'),
        ];
        $this->products->update($id, $data);
---
UPDATE `products` SET `product` = 'GbCwgdENFP', `category` = 'Bus', `model` = 'mlwFMddnoJ', `price` = '133', `sku` = 'EFlYGmVXJQ'
WHERE `products`.`product_id` IN ('5')