ci_project1/app/Controllers/ProductController.php

    public function delete($id){
        //echo $id;
        $this->products->where('product_id', $id);
        $this->products->delete();
---
DELETE FROM `products`
WHERE `product_id` = '11'