ci_project1/app/Controllers/SigninController.php

    public function login()
    {
        $userModel = new UserModel();

        $session = session();
        $email = $this->request->getVar('email');
        $formPass = $this->request->getVar('password');

        //$formPass = password_hash($formPass, PASSWORD_DEFAULT);

        $data = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'mizanur1326@gmail.com'
 LIMIT 1